``` sql
create table student(name varchar(50));
insert into student values('Tanweer,Khan');
insert into student values('Khan,Tanweer');
insert into student values('Aman,Kumar');
insert into student values('Kumar,Aman');

select * from student;

+--------------+
| name         |
+--------------+
| Tanweer,Khan |
| Khan,Tanweer |
| Aman,Kumar   |
| Kumar,Aman   |
+--------------+

Question:
Q. By mistake, the user has inserted 2 records for the same employee in the below format:
Firstname,Lastname and LastName,FirstName
Write an SQL query to display the unique records only.

Expected Output:
+--------------+
| name         |
+--------------+
| Khan,Tanweer |
| Aman,Kumar   |
+--------------+
```
---

#### **Solution-1:**

``` sql
select concat(first_name,',', last_name) as name 
from
(
select SUBSTRING_INDEX(name,',',1) as first_name,
SUBSTRING_INDEX(name,',',-1) as last_name
from student
)a
where first_name < last_name;
```
---